Repository: yashvyas29/YVCounter
Catalog: lib/l10n/app_*.arb
Languages: hi

# title
source: YVCounter
hi: माला गणक

# welcomeUser
source: Welcome {name}
hi: स्वागत है {name} जी

source: Mala
hi: माला

source: Jap
hi: जप

# completedForDate
source: Your completed {malaJapString} on
hi: आपकी पूर्ण की गई {malaJapString}

source: Add
hi: जोड़े

source: Mala History
hi: माला इतिहास

source: Date
hi: दिनांक

source: Family List
hi: परिवार सूची

source: About
hi: जानकारी

# myName
source: Yash Vyas
hi: यश व्यास

# aboutText
source: YVCounter app is created for solving a common scenario of counting malas or japs which is done by hindu religion pepole during meditation. In Hinduism the jap mala is used to direct and count the recitation of mantras during meditation. It usually consists of 108 beads strung in a circle to represent the cyclic nature of life.
hi: माला गणक अनुप्रयोग माला या जप की गिनती के एक सामान्य परिदृश्य को हल करने के लिए बनाया गया है जो हिंदू धर्म के लोगों द्वारा ध्यान के दौरान किया जाता है। हिंदू धर्म में जप माला का उपयोग ध्यान के दौरान मंत्रों के पाठ को निर्देशित करने और गिनने के लिए किया जाता है। इसमें आमतौर पर जीवन की चक्रीय प्रकृति का प्रतिनिधित्व करने के लिए एक चक्र में पिरोए गए 108 मोती होते हैं।

source: Menu
hi: सूची

# changeLanguageTo
source: Change Language to {language}
hi: भाषा को {language} में बदलें

source: English
hi: अंग्रेज़ी

source: Hindi
hi: हिन्दी

# backupToExcel
source: Backup Mala to Excel
hi: एक्सेल में माला का बैकअप लें

# restoreFromExcel
source: Restore Mala from Excel
hi: एक्सेल से माला पुनर्स्थापित करें

# backupToGD
source: Backup to Google Drive
hi: गूगल ड्राइव पर बैकअप लें

# restoreFromGD
source: Restore from Google Drive
hi: गूगल ड्राइव से पुनर्स्थापित करें

# deleteBackupFromGD
source: Delete Backup from Google Drive
hi: गूगल ड्राइव से बैकअप हटाएं

# signOutFromGD
source: Sign Out from Google Drive
hi: गूगल ड्राइव से साइन आउट करें

source: New Family
hi: नया परिवार

source: Vyas Family
hi: व्यास परिवार

source: Kadvawat Family
hi: कड़वावत परिवार

source: Dharmawat Family
hi: धर्मावत परिवार

# excelSaveSuccessful
source: Excel saved successfully.
hi: एक्सेल सफलतापूर्वक सहेजा गया।

# gdRestoreSuccessful
source: Google Drive restore successful.
hi: गूगल ड्राइव पुनःस्थापना सफल रहा।

source: Excel restore successful.
hi: एक्सेल पुनर्स्थापना सफल रहा।

# gdBackupSuccessful
source: Google Drive backup done successfully.
hi: गूगल ड्राइव बैकअप सफलतापूर्वक किया गया।

# excelBackupSuccessful
source: Excel backup done successfully.
hi: एक्सेल बैकअप सफलतापूर्वक किया गया।

# gdDataDeleteSuccessful
source: App data deleted successfully from Google Drive.
hi: गूगल ड्राइव से ऐप डेटा सफलतापूर्वक हटा दिया गया।

source: Changing Language
hi: भाषा बदल रहे है।

source: Backup in Progress
hi: बैकअप कर रहे है।

source: Restoring from Backup
hi: बैकअप से पुनर्स्थापित कर रहे है।

source: Excel Backup in Progress
hi: एक्सेल बैकअप प्रगति पर है।

source: Restoring from Excel
hi: एक्सेल से पुनर्स्थापित कर रहे है।

# deletingBackupFromGD
source: Deleting Backup from Google Drive
hi: गूगल ड्राइव से बैकअप हटा रहे है।

# signingOutFromGD
source: Signing Out from Google Drive
hi: गूगल ड्राइव से साइन आउट कर रहे है।

# malaNotAvailable
source: No mala available.
hi: कोई माला उपलब्ध नहीं है।

# familyNotAvailable
source: No family available.
hi: कोई परिवार उपलब्ध नहीं है।

source: Backup not available.
hi: बैकअप उपलब्ध नहीं है।

# saveError
source: Save failed.
hi: सहेजना विफल रहा।

# backupError
source: Backup failed.
hi: बैकअप विफल रहा।

# restoreError
source: Restore failed.
hi: Restore विफल रहा।

# deleteError
source: Delete failed.
hi: पुनर्स्थापन विफल रहा।

# deleteConfirmation
source: Are you sure you want to delete {name} ?
hi: क्या आप वाकई {name} को हटाना चाहते हैं?

source: Alert
hi: सूचना

source: Delete
hi: मिटाए

source: Cancel
hi: रद्द करे
